; domain
(define (domain ferry)
  (:requirements :strips :constraints :negative-preconditions)
   (:predicates (not-eq ?v5 ?v1)
		(pred_3 ?v3)
		(pred_5 ?v7)
		(pred_6 ?v7)
		(pred_2 ?v3 ?v7)
		(pred_1)
		(pred_4 ?v3))

   (:action op_1
       :parameters  (?v6 ?v8)
       :precondition (and (not-eq ?v6 ?v8) 
                          (pred_5 ?v6) (pred_5 ?v8) (pred_6 ?v6))
       :effect (and  (pred_6 ?v8)
		     (not (pred_6 ?v6))))


   (:action op_2
       :parameters (?v4 ?v2)
       :precondition  (and  (pred_3 ?v4) (pred_5 ?v2)
			    (pred_2 ?v4 ?v2) (pred_6 ?v2) (pred_1))
       :effect (and (pred_4 ?v4)
		    (not (pred_2 ?v4 ?v2)) 
		    (not (pred_1))))

   (:action op_3
       :parameters  (?v4  ?v2)
       :precondition  (and  (pred_3 ?v4) (pred_5 ?v2)
			    (pred_4 ?v4) (pred_6 ?v2))
       :effect (and (pred_2 ?v4 ?v2)
		    (pred_1)
		    (not (pred_4 ?v4)))))

; problem
(define (problem ferry-l5-c3)
(:domain ferry)
(:objects obj_03 obj_01 obj_08 obj_06 obj_04 
          obj_02 obj_05 obj_07 
)
(:init
(pred_5 obj_03)
(pred_5 obj_01)
(pred_5 obj_08)
(pred_5 obj_06)
(pred_5 obj_04)
(pred_3 obj_02)
(pred_3 obj_05)
(pred_3 obj_07)
(not-eq obj_03 obj_01)
(not-eq obj_01 obj_03)
(not-eq obj_03 obj_08)
(not-eq obj_08 obj_03)
(not-eq obj_03 obj_06)
(not-eq obj_06 obj_03)
(not-eq obj_03 obj_04)
(not-eq obj_04 obj_03)
(not-eq obj_01 obj_08)
(not-eq obj_08 obj_01)
(not-eq obj_01 obj_06)
(not-eq obj_06 obj_01)
(not-eq obj_01 obj_04)
(not-eq obj_04 obj_01)
(not-eq obj_08 obj_06)
(not-eq obj_06 obj_08)
(not-eq obj_08 obj_04)
(not-eq obj_04 obj_08)
(not-eq obj_06 obj_04)
(not-eq obj_04 obj_06)
(pred_1)
(pred_2 obj_02 obj_04)
(pred_2 obj_05 obj_08)
(pred_2 obj_07 obj_01)
(pred_6 obj_04)
)
(:goal
(and
(pred_2 obj_02 obj_01)
(pred_2 obj_05 obj_03)
(pred_2 obj_07 obj_01)
)
)

(:constraints
  (and
    (sometime-before  (pred_2 obj_02 obj_01) (pred_6 obj_03))
    (sometime-before  (pred_2 obj_05 obj_03) (pred_6 obj_01))
  )
)
)

; plan
1. (op_2 obj_02 obj_04)
   deleted: (pred_2 obj_02 obj_04) (pred_1)
   added: (pred_4 obj_02)
   goals met: 1 of 3
2. (op_1 obj_04 obj_08)
   deleted: (pred_6 obj_04)
   added: (pred_6 obj_08)
   goals met: 1 of 3
3. (op_1 obj_08 obj_01)
   deleted: (pred_6 obj_08)
   added: (pred_6 obj_01)
   goals met: 1 of 3
4. (op_1 obj_01 obj_03)
   deleted: (pred_6 obj_01)
   added: (pred_6 obj_03)
   goals met: 1 of 3
5. (op_3 obj_02 obj_03)
   deleted: (pred_4 obj_02)
   added: (pred_2 obj_02 obj_03) (pred_1)
   goals met: 1 of 3
6. (op_1 obj_03 obj_08)
   deleted: (pred_6 obj_03)
   added: (pred_6 obj_08)
   goals met: 1 of 3
7. (op_2 obj_05 obj_08)
   deleted: (pred_2 obj_05 obj_08) (pred_1)
   added: (pred_4 obj_05)
   goals met: 1 of 3
8. (op_1 obj_08 obj_03)
   deleted: (pred_6 obj_08)
   added: (pred_6 obj_03)
   goals met: 1 of 3
9. (op_3 obj_05 obj_03)
   deleted: (pred_4 obj_05)
   added: (pred_2 obj_05 obj_03) (pred_1)
   goals met: 2 of 3
10. (op_2 obj_02 obj_03)
   deleted: (pred_2 obj_02 obj_03) (pred_1)
   added: (pred_4 obj_02)
   goals met: 2 of 3
11. (op_1 obj_03 obj_01)
   deleted: (pred_6 obj_03)
   added: (pred_6 obj_01)
   goals met: 2 of 3
12. (op_3 obj_02 obj_01)
   deleted: (pred_4 obj_02)
   added: (pred_2 obj_02 obj_01) (pred_1)
   goals met: 3 of 3
